app/Http/traits/Sections.php

insert into `sections` (`ar_name`, `en_name`, `ar_info`, `en_info`, `user_id`, `updated_at`, `created_at`) values ('متميز', 'excellent', 'dasd', 'dasd', 1, '2023-10-30 03:44:54', '2023-10-30 03:44:54')
---
    public function save_section(sectionsFormRequest $request){
        $data = $request->validated();
        $data['user_id'] = auth()->id();
        DB::beginTransaction();
        $section = \App\Models\sections::query()->updateOrCreate([
            'id'=>$data['id'] ?? null
        ],$data);