app/Http/traits/SectionsHelper.php

    public static function specific_section($name){
        $output =  $sections = \App\Models\sections::query()
            ->when($name != "first",function($e) use ($name){
                $e->where('id','=',$name);
            })
            ->with(['attributes','image'])
            ->first();
---
select `attributes`.*, `sections_attributes`.`section_id` as `pivot_section_id`, `sections_attributes`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `sections_attributes` on `attributes`.`id` = `sections_attributes`.`attribute_id` where `sections_attributes`.`section_id` in (1)