app/Http/traits/TemplatesHelper.php

select * from `templates` where `templates`.`parent_id` in (82, 83, 84, 85) and `templates`.`deleted_at` is null
select * from `users` where `users`.`id` in (2, 6) and `users`.`deleted_at` is null
select count(*) as aggregate from `templates` where parent_id is null and `price` = 0 and `category_id` LIKE '%1%' and (name LIKE "%سي%") and `templates`.`deleted_at` is null
---
    public function all_templates(){
        $templates =  $this->all_templates_info()
            ->public()->parent()
            ->with('children.user.image')
            ->with('user.image')
            ->withCount('sections')
            ->with('image')->orderBy('id','DESC');
        $output = app(Pipeline::class)
                 ->send($templates)
                  ->through([
                    NameFilter::class,
                    UserId::class,
                    CategoryId::class,
                    PriceFilter::class
                 ])
                ->thenReturn()
                ->paginate(10);