app/Http/Actions/ImageModalSave.php

insert into `images` (`imageable_id`, `imageable_type`, `name`, `updated_at`, `created_at`) values (3, 'App\Models\sections', 'sections/16986374946217939003900_image.jpeg', '2023-10-30 03:44:54', '2023-10-30 03:44:54')
---
    public static function make($id,$model_name,$image_file){
        images::query()->create([
            'imageable_id'=>$id,
            'imageable_type'=>'App\Models\\'.$model_name,
            'name'=>$image_file,
        ]);