app/Http/Controllers/Api/auth/AuthControllerApi.php

select * from `roles` where `roles`.`id` = 1 and `roles`.`deleted_at` is null limit 1
select * from `users` where `serial_number` = '1700292049' and `users`.`deleted_at` is null limit 1
---
    public function login_api(){
        if(request()->filled('serial_number')){
            $user = User::query()->where('serial_number','=',request('serial_number'))->first();
            $token = auth('api')->login($user);
            $user = auth('api')->user();
            $user['token'] =  $token;
            $user['role'] = roles::query()->find($user->role_id);
            return $user;
        }else {
            $data = Validator::make(request()->all(), [
                'email' => 'required',
                'password' => 'required',
            ]);
        }
        if(sizeof($data->errors()) == 0) {

            $credential = request()->only(['email', 'password']);
            $token = auth('api')->attempt($credential);
            if(!$token){
               // return response()->json('error in email or password',401);
                return response()->json(['errors'=>trans('errors.unauthenticated')],401);
            }else {
                $user = auth('api')->user();
                $user['token'] =  $token;
                $user['role'] = roles::query()->find($user->role_id);