app/Http/Controllers/UsersCvsController.php

select * from `templates` where `templates`.`id` in (1) and `templates`.`deleted_at` is null
select * from `users` where `users`.`id` in (2) and `users`.`deleted_at` is null
---
    public function index(){
        $data = users_cvs::query()->with(['user','template'])->orderBy('id','DESC');
        $output = app(Pipeline::class)
            ->send($data)
            ->through([
                TemplateId::class,
                UserId::class,
            ])
            ->thenReturn()
            ->paginate(15);

insert into `users_cvs` (`user_id`, `template_id`, `updated_at`, `created_at`) values (2, '1', '2023-11-26 18:11:13', '2023-11-26 18:11:13')
---
    public function save(){
        $output = users_cvs::query()->updateOrCreate([
            'id'=>request('id') ?? null
        ],[
            'user_id'=>auth()->id(),
            'template_id'=>request('template_id')
        ]);

insert into `users_cvs_sections` (`user_cv_id`, `section_id`, `order`, `updated_at`, `created_at`) values ('2', '1', 1, '2023-12-05 20:50:17', '2023-12-05 20:50:17')
select * from `sections` where `sections`.`id` in (1) and `sections`.`deleted_at` is null
select `templates`.*, `users_cvs`.`template_id` as `laravel_through_key` from `templates` inner join `users_cvs` on `users_cvs`.`id` = `templates`.`id` where `users_cvs`.`template_id` in (12) and `templates`.`deleted_at` is null
---
    public function save_section(cvSectionFormRequest $request){
        // get last order


        $data = $request->validated();
        if(!(request()->has('id'))) {
            $order = $this->get_last_order(request('user_cv_id'));
            $data['order'] = $order;
        }
        //dd($data);
        $output = users_cvs_sections::query()->updateOrCreate([
            'id'=>$data['id'] ?? null
        ],$data);

        $output = users_cvs_sections::query()->orderBy('id','DESC')->with(['section','user_cv.template'])->find($output->id);

insert into `users_cvs_sec_attr_value` (`user_cv_section_id`, `attribute_id`, `answer`, `answer_type`, `content_width`, `updated_at`, `created_at`) values ('12', '1', 'dasd', 'selection', '100', '2023-12-05 22:26:30', '2023-12-05 22:26:30')
---
    public function save_attr_val(userCvSecAttrValFormRequest $request){
        $data = $request->validated();
        $output = users_cvs_sec_attr_value::query()->updateOrCreate([
            'id'=>$data['id'] ?? null
        ],$data);